[
{"name": "Bessie", "date": "2nd June 2019", "text": ["Ok I hope I don’t upset anyone but in really self conscious we were in drama and a bunch of boys said that they want me to suck their cock and then they followed me home after the lesson each touching my breasts and my thighs I told them to stop but then they said that no one would believe me if i told them because I’m to ugly to be raped .I have tried extremely hard to lose weight as I am the fattest and ugliest out of all of my friends.I  am sorry if I offend anyone I’m 13 by the way"], "tags": []},
{"name": "Creepy old men", "date": "2nd June 2019", "text": ["Married very old  friend of my dads thought my polite two minute conversation meant he was in with a chance followed me home to see where I lived and posted a love letter basically saying I belonged to him and he to me.", "\nHe’s about fifty years older than me but hey talking politely to your dads workmate one one occasion is a massive come on isn’t it?", "\nLol I still live with my dad as we moved so he didn’t realise my dad lives here too, very glad he does, I showed him the letter.", "\nTwat.", "\nPresumptuous creepy adulterous twat. Not a compliment.", "\nSad how happy I am that I live with my dad most men find it such a put off and good because it keeps them away.", "\nI’ve only recently learnt it’s ok to tell men like this to fuck off, I was too polite to older men because they are old, not any more. If they are creepy they will get called out."], "tags": ["Public space"]},
{"name": "London", "date": "2nd June 2019", "text": ["Twenty years ago", "\nMy Muslim friend was married off at 12 by her dad on holiday", "\nWe got a postcard never saw her again", "\nHe didn’t like her hanging round with Christians", "\nChristophobia  and sexism.", "\nApparently 12 years free education in England is more than enough for a girl to look classy and be a helpful English speaking wife then back to Pakistan"], "tags": ["School"]},
{"name": "Dumb", "date": "2nd June 2019", "text": ["A couple of years ago", "\nWe did a pub quiz and I got a load of crap for not knowing celebrity gossip – who’s dating whom?", "\nI just got all the science ones right but that’s not good enough", "\nIt’s not like they don’t know I was doing a science degree and had been seen with a massive physics book !", "\nUnlike my male quizzmates who watched endless trash tv one had no gcse s at all, and the other had rubbish A level – low grades and retakes incuding media studies. ", "Which ones would you expect to know the shit non academic questions? The girl apparently! Cos girls like romance innit!", "\nBut it was still my fault even though I hate quizzes and was making up the number s to do them a favour… never again."], "tags": ["Public space"]},
{"name": "Oddball neighbour", "date": "2nd June 2019", "text": ["I have been emailed by a neighbours  husband in a weird way the email came from his email address not hers but obviously he got my email address from her. I actually don’t know what to do about this now I saw them both together last week and it’s gone from “that nice couple” to wtf mind games does she know he sent that random massage offer?", "\nI now feel really uncomfortable but on the surface it was  same as before nice smiley neighbour couple, come in anytime, come and sit down only I don’t really want to be alone with him… I’m just out of hospital and quite frail I don’t need this , I tried to pretend I hadn’t seen them but he saw me stagger past and called me over – they only live 15 metres away and he’s offering massages? Just odd and creepy.", "\nHe’s not a masseuse. It seemed really inappropriate. Maybe I’m paranoid as I’ve been sexually assaulted in past and also had problems with inappropriate and random post op. massage offers that escalate before –  it seems to be a thing with healthy men on sick women.", "\nI showed a friend and she totally thought it was a come on. So it wasn’t just me.", "\nHere we go again, do I ask the wife if she knows he offered whilst telling me he wasn’t any good at massage but wanted to practise?", "\nPlease guys stop doing this! Use some sensitivity. If I wanted a massage I’d get the district nurse in or my mum.", "\nI went into polite mode and he was just smiling at me while she chatted so I think she doesn’t know and part of me thinks it’s a kinky power trip. And yet honestly he seems friendly and ok too, so maybe he’s just clumsy and clueless. Don’t want to cause trouble for this couple or jump in blaming anyone.  I just don’t know whether to mention it again and I’ve tired of having to work this stuff out….", "\nI’m sure some healthy men might get similar odd offers from married women but you can be a lot more assertive when you are well… it does seem to be sick women getting them from healthy men when we can’t exactly run far or fast..,,", "\nIs this sexism ? Do sick men get this?", "\nI know which gender is most likely to perpetrate sexual assault and really that should be a factor to think about before you send an email offering your amateur physical services to your neighbour.", "\nIf I  wanted medical massage he knows full well I could get it off my mum.  It must be a come on. How odd. How creepy. Does she know and do I say? If I mention it to my mum I know she’ll just say it’s not a thing and not cause a fuss.", "\nFeel a bit less safe, thanks"], "tags": ["Home"]},
{"name": "Matilda", "date": "2nd June 2019", "text": ["the first time i was catcalled i was 12 in my school uniform waiting for a bus. i was told to “sit on my face slut”. i was raised to stand up against sexism so i responded with a get lost. i was then chased by the two 30 year old men in their car for 5 minuets being screamed at and being told what they were going to do to me when they got a hold of me. i have never said anything when catcalled again."], "tags": ["Public space", "Public Transport"]},
{"name": "Nora", "date": "2nd June 2019", "text": ["I was almost driven to anorexia in my teens. I dropped from about 130 lbs to about 110 in 6 months when I was 16 (5’8″, just for perspective), only to be rudely told by friends of my parents that I’m too thin.", "In my 20s, I was constantly unsatisfied with my body, fluctuating between 135 and 150 and always aiming to “get the weight off”", "At 30 I got a wakeup call, and realized that my body’s perfectly healthy and wonderful the way it is.", "Now I’m 33, 145 lbs, pretty active, and never once does it cross my mind that I should lose weight. However, when I mentioned to a fellow musician last week, a woman my age and a little bit thinner than me, that I was trying to eat healthy, she instantly started telling me how I needed to track all my calories and do sports every day and watch the carbs in order to lose weight. I was stunned. I told her, I don’t aim to lose weight. She looked at me blankly and said “really?”", "I’m ashsmed to even say it, but I’ve felt fat ever since she said that. I can’t shake it. I feel every ounce of fat on my body, which until then had felt sexy, now feels like an unwanted blanket. For some reason this comment has affected me deeply. There is something inherently wrong with a society that looks at a healthy body and thinks of it as a problem needing to be solved. (And by healthy body I don’t just mean mine, I mean others who are heavier than average but happy at their size too)"], "tags": ["body image"]},
{"name": "Jen", "date": "2nd June 2019", "text": ["Been dating a guy for a while when I was seventeen one night he’d been drinking before he came round to hang out with me. I’d never been with a guy before and we’d agreed to take things slow. Slowly one thing started leading to the other when it happened I froze up and asked him to stop. His response “we’re already having sex though” he didn’t.", "A few months later on a bus on my way to work with headphones in when I feel a tap on my shoulder and a headphone tugged from my ear. The guy behind me who looked mid to late twenties started telling me I had pretty hair, wanted to know what my name was, where I was going, where I lived, where I worked, if he could come spend time with me. I told him I was seventeen,which I hoped would get him to back off but the dude didn’t bat an eyelid. So I lied said I’d just finished work at a made up cafe, and my dad was picking me up from the bus stop. The dude thankfully backed off after that but stared at me till he got off at his stop.", "Few years later was at a club with group of friends. I’d just left the ladies and was walking by myself to meet my friends by the bar when some guy pinned me against the wall and tried to kiss me. Had to tell him three times to cut it out before he let me go. Worst part is when I looked over his shoulder at my friends one of my guy friends was watching what was happening but did nothing to help even though he knew I was in a relationship and was clearly uncomfortable. Have had another guy try and grab at me in a bar/club but he wasn’t as aggressive about it and backed off pretty quick.", "Current boyfriend’s friends being inappropriate when drunk touching my lower back being too forward even though they all have serious partners and I’m with my boyfriend who’s their friend. ", "Catcalled a couple times, guys mansplain things on a regular basis, and recently had a male colleague look me up and down while passing him in the car park. Not that what I was wearing should matter but was literally wearing jeans a baggy shirt and a jacket. Actually try to dress androgynously to avoid attention and guys been creepy. ", "Sexism is sadly alive and well"], "tags": []},
{"name": "Bill", "date": "2nd June 2019", "text": ["A teenage boy laughingly mocked another teenage boy about chess: “He lost to a female!”"], "tags": ["School"]},
{"name": "Amadala", "date": "2nd June 2019", "text": ["I was going on a jet-ski with my male cousin (we’re both 16), and so came out in my red, beautiful bathing suit (I am very proud of it, it’s my favorite). My mom then says (joking), that I shouldn’t wear that as I’ll distract him from driving. I know she was kidding but it’s still the concept, that I am responsible for his recklessness and he is incapable of self-regulating, that women always have to hide “temptation” from men because they are impulsive apes.. ugh.."], "tags": ["Home"]}
]